[
  {
    "id": "1759638491197",
    "title": "The Flavors of India: A Journey Through Taste",
    "author": "Prabhakar More",
    "content": "India is a land of diverse cultures, and its food beautifully reflects that diversity. From the spicy curries of the South to the rich gravies of the North, every region has something special to offer.\n\nDuring my recent food adventure, I tasted dishes that told stories of tradition and love. The crispy dosas from Tamil Nadu, the flavorful biryani from Hyderabad, and the sweet rasgullas from Bengal each had a unique charm. What amazed me most was how every meal was made with care, using fresh spices and local ingredients that gave each dish its identity.\n\nIndian food is not just about taste — it’s about experience. Sharing a meal brings people together, creating memories that last forever. Whether it’s street food or a festive feast, every bite in India is a celebration of flavor, culture, and warmth.",
    "createdAt": "2025-10-05T04:28:11.197Z"
  },
  {
    "id": "1759637891520",
    "title": "A Journey to the Hills of Munnar",
    "author": "Prabhakar More",
    "content": "Nestled in the Western Ghats of Kerala, Munnar is a dream destination for every nature lover. As I drove up the winding roads surrounded by endless tea gardens, the cool breeze and misty air instantly made me feel refreshed. The lush green hills, the sound of chirping birds, and the aroma of fresh tea leaves created a magical atmosphere.\n\nI visited Echo Point, where every shout bounces back with a playful echo, and Mattupetty Dam, a serene spot perfect for boating. The highlight of my trip was watching the sunrise from Top Station, where the golden light spread over the valley like a painting.\n\nMunnar is more than just a hill station — it’s a peaceful escape where time slows down and nature speaks to your soul. I left with unforgettable memories and a promise to return soon.",
    "createdAt": "2025-10-05T04:18:11.520Z",
    "updatedAt": "2025-10-05T04:18:35.171Z"
  },
  {
    "id": "1759637806636",
    "title": "Wings of Fire – The Inspiring Journey",
    "author": "Dr. A.P.J. Abdul Kalam",
    "content": "Wings of Fire is the autobiography of Dr. A.P.J. Abdul Kalam, one of India’s most respected scientists and the 11th President of India. The book was written by Dr. Kalam along with Arun Tiwari, and it tells the story of his life — from his childhood in the small town of Rameswaram, Tamil Nadu, to his remarkable achievements in India’s space and missile programs.\n\nThe book beautifully describes Dr. Kalam’s early life struggles, his education, and his deep curiosity about science. It highlights his work with organizations like ISRO (Indian Space Research Organisation) and DRDO (Defence Research and Development Organisation), where he played a major role in developing the Agni and Prithvi missiles. His dedication and passion earned him the title “Missile Man of India.”\n\nBeyond science, Wings of Fire shares Dr. Kalam’s values — hard work, honesty, simplicity, and faith in God. It teaches readers that no dream is too big if one is willing to work for it. The book continues to inspire millions of students and readers around the world to believe in themselves and serve their country with pride.",
    "createdAt": "2025-10-05T04:16:46.636Z"
  }
]